IDEA StatiCa Open Model
CrossSectionFactory.FillShapeDblU Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Creates a ][ steel shape of css.
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillShapeDblU(
	CrossSectionParameter css,
	double bt,
	double bb,
	double h,
	double tb,
	double tl,
	double tr,
	double dis
)
Public Shared Sub FillShapeDblU (
	css As CrossSectionParameter,
	bt As Double,
	bb As Double,
	h As Double,
	tb As Double,
	tl As Double,
	tr As Double,
	dis As Double
)
public:
static void FillShapeDblU(
	CrossSectionParameter^ css,
	double bt,
	double bb,
	double h,
	double tb,
	double tl,
	double tr,
	double dis
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
bt
Type: System.Double
The width of U top flange.
bb
Type: System.Double
The width of U bottom flange.
h
Type: System.Double
The height of U shape.
tb
Type: System.Double
The bottom deck thickness.
tl
Type: System.Double
The left deck thickness.
tr
Type: System.Double
The right deck thickness.
dis
Type: System.Double
Distance between ][
Remarks
Dimension of assymetrical I section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 5;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double bt = 0.150;
double bb = 0.180;
double h = 0.320;
double tb = 0.016;
double tfu = 0.014;
double tfb = 0.018;
double dis= 0.025;
CrossSectionFactory.FillShapeDblU(css, bt, bb, h, tb, tl, tr, dis);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace